In [1]:
import env
import pandas as pd
import numpy as np
from pydataset import data

In [2]:
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [3]:
def get_db_url():
    url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [4]:
df_employees = pd.read_sql('select * from employees limit 5', url)
df_employees

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [5]:
# Intentionally make a typo in db url

# OperationalError: (pymysql.err.OperationalError) 
# (1044, "Access denied for user 'oneil_2095'@'%' to database 'employees1'")
# (Background on this error at: https://sqlalche.me/e/14/e3q8)

In [6]:
# Intentionally make an error in your SQL query

# ProgrammingError: (pymysql.err.ProgrammingError) 
# (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '5' at line 1")
# [SQL: select * from employees liimit 5]
# (Background on this error at: https://sqlalche.me/e/14/f405)

In [7]:
# Read the employees and titles tables into two separate DataFrames

df_employees = pd.read_sql('select * from employees limit 5', url)
df_employees

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [8]:
url_tables = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [9]:
df_titles = pd.read_sql('select * from titles limit 5', url)
df_titles

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [10]:
# How many rows and columns do you have in each DataFrame? Is that what you expected?

# employees
# 6 columns
# 5 rows


# Yes.

df_employees.shape
df_titles.shape

(5, 4)

In [11]:
# Display the summary statistics for each DataFrame.

# df_titles.value_counts(), df_employees.value_counts()

df_titles.describe(), df_employees.describe()

(            emp_no
 count      5.00000
 mean   10002.80000
 std        1.30384
 min    10001.00000
 25%    10002.00000
 50%    10003.00000
 75%    10004.00000
 max    10004.00000,
              emp_no
 count      5.000000
 mean   10003.000000
 std        1.581139
 min    10001.000000
 25%    10002.000000
 50%    10003.000000
 75%    10004.000000
 max    10005.000000)

In [12]:
df_titles.info(), df_employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   emp_no     5 non-null      int64
 1   title      5 non-null      object
 2   from_date  5 non-null      object
 3   to_date    5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   emp_no      5 non-null      int64
 1   birth_date  5 non-null      object
 2   first_name  5 non-null      object
 3   last_name   5 non-null      object
 4   gender      5 non-null      object
 5   hire_date   5 non-null      object
dtypes: int64(1), object(5)
memory usage: 368.0+ bytes

(None, None)

In [13]:
# How many unique titles are in the titles DataFrame
df_titles['title'].value_counts()

# nunique

Senior Engineer    3
Staff              1
Engineer           1
Name: title, dtype: int64

In [14]:
# What is the oldest date in the to_date column

df_titles.sort_values(by=['to_date']).head(1)

   emp_no     title   from_date     to_date
3   10004  Engineer  1986-12-01  1995-12-01

In [15]:
# What is the most recent date in the to_date column?

df_titles.sort_values(by=['to_date']).tail(1)

   emp_no            title   from_date     to_date
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [16]:
# Exercise II

In [17]:
# Copy the users and roles DataFrames from the examples above

In [18]:
# users
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [19]:
# roles
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [20]:
# What is the result of using a right join on the DataFrames?
# pd.merge(df1,df2, how='', on='column_name')

pd.merge(users, roles, how='right', left_on ='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [21]:
# What is the result of using an outer join on the DataFrames?

pd.merge(users, roles, how='outer', left_on ='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [22]:
# What happens if you drop the foreign keys from the DataFrames and try to merge them?

pd.merge(users, roles, how='inner')

Empty DataFrame
Columns: [id, name, role_id]
Index: []

In [23]:
# Load the mpg dataset from PyDataset

mpg = data('mpg')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [24]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [25]:
# How many rows and columns are in the dataset?

type(mpg)
mpg.shape

(234, 11)

In [26]:
# Check out your column names and perform any cleanup you may want on them.

mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

In [27]:
mpg.rename(columns = {'displ': 'display', 'drv': 'drive', 'cty': 'city', 'hwy': 'highway'}, inplace = True)
mpg

,manufacturer,model,display,year,cyl,trans,drive,city,highway,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [28]:
# Display the summary statistics for the dataset.

mpg.describe().round()

       display    year    cyl   city  highway
count    234.0   234.0  234.0  234.0    234.0
mean       3.0  2004.0    6.0   17.0     23.0
std        1.0     5.0    2.0    4.0      6.0
min        2.0  1999.0    4.0    9.0     12.0
25%        2.0  1999.0    4.0   14.0     18.0
50%        3.0  2004.0    6.0   17.0     24.0
75%        5.0  2008.0    8.0   19.0     27.0
max        7.0  2008.0    8.0   35.0     44.0

In [29]:
# How many different manufacturers are there?

len(mpg['manufacturer'].value_counts())

15

In [30]:
# How many different models are there?

len(mpg['model'].value_counts())

38

In [31]:
# Create a column named mileage_difference like you did in the DataFrames exercises; 
# this column should contain the difference between highway and city mileage for each car.

mpg = mpg.assign(mileage_difference =  mpg.highway - mpg.city)
mpg

,manufacturer,model,display,year,cyl,trans,drive,city,highway,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

In [32]:
# Create a column named average_mileage like you did in the DataFrames exercises; 
# this is the mean of the city and highway mileage.

average_mpg = mpg[['city','highway']].mean(axis=1)
mpg = mpg.assign(average_mileage = average_mpg)
mpg

,manufacturer,model,display,year,cyl,trans,drive,city,highway,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission

In [34]:
mpg['is_automatic'] = mpg['trans'].str.startswith('auto')
mpg

,manufacturer,model,display,year,cyl,trans,drive,city,highway,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [35]:
mpg_manufacturer = mpg.groupby('manufacturer').average_mileage.mean().sort_values(ascending=False)

mpg_manufacturer.nlargest().head(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

Do automatic or manual cars have better miles per gallon?

In [40]:
trans_avg_mpg = mpg.groupby(['trans']).average_mileage.agg(['mean'])
auto = trans_avg_mpg.iloc[:8].mean()
manual = trans_avg_mpg.iloc[8:].mean()
print(auto)
print(manual)

# manual cars

mean    20.773042
dtype: float64
mean    21.664247
dtype: float64